src/InformationRegisters/табАид_ЖурналСобытий/табАид_ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>табАид_ЖурналСобытий</name>
  <resources>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.табАид_ТипыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусСобытия</name>
    <comment>//Истина - без ошибок, Ложь - с ошибками</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусДоставки</name>
    <comment>//Истина - без ошибок, Ложь - с ошибками</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибкиДоставки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстДиалога</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресФайла</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ГрафикИсполненияДоговора</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйКлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПравила</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ГрафикИсполненияДоговора</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/табАид_ТипыСообщений/табАид_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>табАид_ТипыСообщений</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>ГолосовоеСообщение</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/табАид_ЖурналСобытий/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура СтатусСобытияПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.ПолучитьФайлЗаписиГП.Видимость = (Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.ГолосовоеСообщение"));
	Элементы.ОбновитьСтатусДоставки.Видимость = (Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.ГолосовоеСообщение")
												ИЛИ Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.SMS"));
	Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
	Элементы.ФормаЗаписать.Доступность = Ложь;
	Элементы.ФормаСкопировать.Доступность = Ложь;
	Элементы.ФормаУдалить.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлЗаписиГП(Команда)
	
	Если ЗначениеЗаполнено(Запись.АдресФайла) Тогда
		Попытка
			//ЭтотОбъект.Браузер = Запись.АдресФайла;
			ПерейтиПоНавигационнойСсылке(Запись.АдресФайла);
		Исключение
			Сообщить("Ошибка получения файла аудиозаписи. " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Не определен файл аудиозаписи.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусДоставки(Команда)
	Если Запись.СтатусСобытия = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение не было отправлено!");
		Возврат;	
	КонецЕсли;
	
	ОбновитьСтатусДоставкиНаСервере(Запись.УникальныйКлючЗаписи, Запись.ТипСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусДоставкиНаСервере(ИдентификаторСообщения, ТипСообщения)
	
	Если ТипСообщения = Перечисления.табАид_ТипыСообщений.ГолосовоеСообщение Тогда 
		табАид_ОтправкаГолосовойПочты.СтатусДоставки(ИдентификаторСообщения);
	ИначеЕсли ТипСообщения = Перечисления.табАид_ТипыСообщений.SMS Тогда
		табАид_ОтправкаSMS.СтатусДоставки(ИдентификаторСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры
